In [1]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [5]:
#filt = (df['last'] == 'Schafer') | (df['first'] == 'John') 
# | is 'or', & is 'and'

In [6]:
#df.loc[~filt, 'email'] #~ gets opposite

In [7]:
email_filter = (df['email'] == 'JohnDoe@email.com')
df.loc[email_filter, 'last'] = 'Smith'

In [8]:
df['email'] = df['email'].str.lower()

In [9]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [10]:
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [11]:
def update_email(email):
    return email.lower()

In [12]:
df['email'].apply(update_email)

0    coreymschafer@gmail.com
1          janedoe@email.com
2          johndoe@email.com
Name: email, dtype: object

In [13]:
df.apply(lambda x: min(x))

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [14]:
df.applymap(str.lower)

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john    smith        johndoe@email.com

In [15]:
#df['full_name'] = df['first'] + ' ' + df['last']

In [16]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [17]:
people = {
    "first": ["Tony", 'Steve'], 
    "last": ["Stark", 'Rogers'], 
    "email": ["IronMan@avengers.com", 'Cap@avengers.com']
}
df2 = pd.DataFrame(people)

In [18]:
df2

   first    last                 email
0   Tony   Stark  IronMan@avengers.com
1  Steve  Rogers      Cap@avengers.com

In [19]:
df = df.append(df2, ignore_index=True)

In [29]:
df.sort_values(by=['last', 'first'], inplace=True)

In [30]:
df

   first     last                    email
1   Jane      Doe        janedoe@email.com
4  Steve   Rogers         Cap@avengers.com
0  Corey  Schafer  coreymschafer@gmail.com
2   John    Smith        johndoe@email.com
3   Tony    Stark     IronMan@avengers.com